### Below we will be connecting to our MySQL DB:

In [14]:
import MySQLdb
import sqlalchemy

In [4]:
%config SqlMagic.autopandas=True

In [8]:
sqlalchemy.create_engine('mysql://root:root@localhost:3306/covid')

Engine(mysql://root:***@localhost:3306/covid)

In [9]:
%load_ext sql

In [10]:
%sql mysql://root:root@localhost:3306/covid

### Let's check if the connection is working:

In [12]:
%%sql

SELECT 
    *
FROM
    covid.coviddeath
limit 5

 * mysql://root:***@localhost:3306/covid
5 rows affected.

,ï»¿iso_code,continent,location,date,population,total_cases,new_cases,new_cases_smoothed,total_deaths,new_deaths,...,new_deaths_smoothed_per_million,reproduction_rate,icu_patients,icu_patients_per_million,hosp_patients,hosp_patients_per_million,weekly_icu_admissions,weekly_icu_admissions_per_million,weekly_hosp_admissions,weekly_hosp_admissions_per_million
0,AFG,Asia,Afghanistan,2020-02-24,38928341,1,1,0.0,0,0.0,...,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,AFG,Asia,Afghanistan,2020-02-25,38928341,1,0,0.0,0,0.0,...,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,AFG,Asia,Afghanistan,2020-02-26,38928341,1,0,0.0,0,0.0,...,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,AFG,Asia,Afghanistan,2020-02-27,38928341,1,0,0.0,0,0.0,...,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,AFG,Asia,Afghanistan,2020-02-28,38928341,1,0,0.0,0,0.0,...,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

### All is set. Now, let's have a look at the main data we will be working with.

In [16]:
%%sql

SELECT 
    location,
    date,
    total_cases,
    new_cases,
    total_deaths,
    population
FROM
    covid.coviddeath
WHERE
    continent <> ''
ORDER BY location , date

 * mysql://root:***@localhost:3306/covid
81060 rows affected.

,location,date,total_cases,new_cases,total_deaths,population
0,Afghanistan,2020-02-24,1,1,0,38928341
1,Afghanistan,2020-02-25,1,0,0,38928341
2,Afghanistan,2020-02-26,1,0,0,38928341
3,Afghanistan,2020-02-27,1,0,0,38928341
4,Afghanistan,2020-02-28,1,0,0,38928341
...,...,...,...,...,...,...
81055,Zimbabwe,2021-04-26,38102,16,1560,14862927
81056,Zimbabwe,2021-04-27,38164,62,1565,14862927
81057,Zimbabwe,2021-04-28,38191,27,1565,14862927
81058,Zimbabwe,2021-04-29,38235,44,1567,14862927
81059,Zimbabwe,2021-04-30,38257,22,1567,14862927

### Looking at Total Cases vs Total Deaths (w/ Death Percentage)

In [19]:
%%sql

SELECT 
    location,
    date,
    total_cases,
    total_deaths,
    (total_deaths / total_cases) * 100 AS death_percentage
FROM
    covid.coviddeath
WHERE
    location LIKE '%France%'
ORDER BY location , date

 * mysql://root:***@localhost:3306/covid
463 rows affected.

    location       date  total_cases  total_deaths death_percentage
0     France 2020-01-24            2             0           0.0000
1     France 2020-01-25            3             0           0.0000
2     France 2020-01-26            3             0           0.0000
3     France 2020-01-27            3             0           0.0000
4     France 2020-01-28            4             0           0.0000
..       ...        ...          ...           ...              ...
458   France 2021-04-26      5565080        103415           1.8583
459   France 2021-04-27      5595403        103762           1.8544
460   France 2021-04-28      5626985        104077           1.8496
461   France 2021-04-29      5653533        104385           1.8464
462   France 2021-04-30      5677835        104675           1.8436

[463 rows x 5 columns]

### Looking at the percentage of population infected with Covid

In [20]:
%%sql

SELECT 
    location,
    date,
    total_cases,
    population,
    (total_cases / population) * 100 AS percent_pop_infected
FROM
    covid.coviddeath
WHERE
    location LIKE '%France%'
ORDER BY location , date

 * mysql://root:***@localhost:3306/covid
463 rows affected.

    location       date  total_cases  population percent_pop_infected
0     France 2020-01-24            2    68147687               0.0000
1     France 2020-01-25            3    68147687               0.0000
2     France 2020-01-26            3    68147687               0.0000
3     France 2020-01-27            3    68147687               0.0000
4     France 2020-01-28            4    68147687               0.0000
..       ...        ...          ...         ...                  ...
458   France 2021-04-26      5565080    68147687               8.1662
459   France 2021-04-27      5595403    68147687               8.2107
460   France 2021-04-28      5626985    68147687               8.2570
461   France 2021-04-29      5653533    68147687               8.2960
462   France 2021-04-30      5677835    68147687               8.3317

[463 rows x 5 columns]

### Countries with Highest Infection Rate as of the 2021-04-30

In [22]:
%%sql

SELECT 
    Location,
    Population,
    MAX(total_cases) AS HighestInfectionCount,
    MAX((total_cases / population)) * 100 AS PercentPopulationInfected
FROM
    covid.coviddeath
GROUP BY Location , population
ORDER BY PercentPopulationInfected DESC

 * mysql://root:***@localhost:3306/covid
219 rows affected.

,Location,Population,HighestInfectionCount,PercentPopulationInfected
0,Andorra,77265,13232,17.1300
1,Montenegro,628062,97389,15.5100
2,Czechia,10708982,1630758,15.2300
3,San Marino,33938,5066,14.9300
4,Slovenia,2078932,240292,11.5600
...,...,...,...,...
214,Turks and Caicos Islands,38718,0,0.0000
215,Vanuatu,307150,4,0.0000
216,Vietnam,97338583,2928,0.0000
217,International,0,721,None
218,Northern Cyprus,0,0,None

### Countries with Highest Death Count per Population

In [23]:
%%sql

SELECT 
    location,
    population,
    MAX(total_deaths) AS Total_Deaths_Count
FROM
    covid.coviddeath
WHERE
    continent <> ''
GROUP BY location , population
ORDER BY Total_Deaths_Count DESC

 * mysql://root:***@localhost:3306/covid
210 rows affected.

                     location  population  Total_Deaths_Count
0               United States   331002647              576232
1                      Brazil   212559409              403781
2                      Mexico   128932753              216907
3                       India  1380004385              211853
4              United Kingdom    67886004              127775
..                        ...         ...                 ...
205                     Samoa      198410                   0
206           Solomon Islands      686878                   0
207                     Tonga      105697                   0
208  Turks and Caicos Islands       38718                   0
209                   Vatican         809                   0

[210 rows x 3 columns]

### BREAKING THINGS DOWN BY CONTINENT

#### Showing contintents with the highest death count per population

In [38]:
%%sql

SELECT 
    location, 
    population, 
    MAX(total_deaths) AS Total_Deaths_Count
FROM
    covid.coviddeath
WHERE
    continent = ''
GROUP BY location, population
ORDER BY Total_Deaths_Count DESC

 * mysql://root:***@localhost:3306/covid
9 rows affected.

         location  population  Total_Deaths_Count
0           World  2147483647             3180238
1          Europe   748680069             1016750
2   North America   592072204              847942
3  European Union   444919060              688896
4   South America   430759772              672415
5            Asia  2147483647              520286
6          Africa  1340598113              121784
7         Oceania    42677809                1046
8   International           0                  15

### WORLD-WIDE NUMBERS

In [40]:
%%sql

SELECT 
    SUM(new_cases) AS total_cases,
    SUM(new_deaths) AS total_deaths,
    SUM(new_deaths) / SUM(New_Cases) * 100 AS DeathPercentage
FROM
    covid.coviddeath
WHERE
    continent <> ''

 * mysql://root:***@localhost:3306/covid
1 rows affected.

  total_cases  total_deaths  DeathPercentage
0   150574977     3180206.0         2.112041

### Shows Percentage of Population that has received at least one Covid Vaccine (w/ CTE)

In [42]:
%%sql

WITH PopvsVac as (
    SELECT 
        d.location, 
        d.date, d.population, 
        v.new_vaccinations, 
        v.total_vaccinations,
        SUM(v.new_vaccinations) OVER (Partition by d.Location Order by d.location, d.Date) as RollingPeopleVaccinated # Fancy way to achieve a less accurate version of total vaccinations
    FROM 
        covid.coviddeath d
    JOIN covid.covidvaccinations v 
        ON d.location = v.location and 
        d.date = v.date
    WHERE 
        d.continent <> '' and 
        d.location like '%France%'
    ORDER by d.location, d.date
)

# Using our CTE to perform Calculation on the Partition By

SELECT
    *, 
    (RollingPeopleVaccinated/population)*100 as PercentVaccinated
FROM 
    PopvsVac

 * mysql://root:***@localhost:3306/covid
463 rows affected.

,location,date,population,new_vaccinations,total_vaccinations,RollingPeopleVaccinated,PercentVaccinated
0,France,2020-01-24,68147687,0,0,0,0.0000
1,France,2020-01-25,68147687,0,0,0,0.0000
2,France,2020-01-26,68147687,0,0,0,0.0000
3,France,2020-01-27,68147687,0,0,0,0.0000
4,France,2020-01-28,68147687,0,0,0,0.0000
...,...,...,...,...,...,...,...
458,France,2021-04-26,68147687,367493,20064358,20064340,29.4424
459,France,2021-04-27,68147687,458823,20523181,20523163,30.1157
460,France,2021-04-28,68147687,467494,20990675,20990657,30.8017
461,France,2021-04-29,68147687,528191,21518866,21518848,31.5768
462,France,2021-04-30,68147687,0,0,21518848,31.5768

### Using Temp Table to perform Calculation on Partition By in previous query

In [50]:
%%sql

# In case we need to alter the table but it already exists
    # DROP Table if exists PercentPopulationVaccinated

 * mysql://root:***@localhost:3306/covid
0 rows affected.

Empty DataFrame
Columns: []
Index: []

In [48]:
%%sql

# Creating the table
Create Table PercentPopulationVaccinated (

    Continent text,
    Location text,
    Date datetime,
    Population int,
    New_vaccinations int,
    Total_vaccinations int
)

 * mysql://root:***@localhost:3306/covid
0 rows affected.

Empty DataFrame
Columns: []
Index: []

In [49]:
%%sql

# Populating our table
Insert into PercentPopulationVaccinated (
    SELECT 
        d.continent,
        d.location,
        d.date,
        d.population,
        v.new_vaccinations,
        v.total_vaccinations
    FROM
        covid.coviddeath d
    JOIN
        covid.covidvaccinations v ON d.location = v.location
        and d.date = v.date
)

 * mysql://root:***@localhost:3306/covid
85171 rows affected.

Empty DataFrame
Columns: []
Index: []

#### Let's check if it worked:

In [51]:
%%sql

Select *, (Total_vaccinations/population)*100 as PercentVaccinated
From PercentPopulationVaccinated

 * mysql://root:***@localhost:3306/covid
85171 rows affected.

,Continent,Location,Date,Population,New_vaccinations,Total_vaccinations,PercentVaccinated
0,,Africa,2020-02-13,1340598113,0,0,0.0000
1,,Africa,2020-02-14,1340598113,0,0,0.0000
2,,Africa,2020-02-15,1340598113,0,0,0.0000
3,,Africa,2020-02-16,1340598113,0,0,0.0000
4,,Africa,2020-02-17,1340598113,0,0,0.0000
...,...,...,...,...,...,...,...
85166,Africa,Zimbabwe,2021-01-24,14862927,0,0,0.0000
85167,Africa,Zimbabwe,2021-02-15,14862927,0,0,0.0000
85168,Africa,Zimbabwe,2021-04-03,14862927,8162,132915,0.8943
85169,Africa,Zimbabwe,2021-04-11,14862927,759,223492,1.5037
85170,Africa,Zimbabwe,2021-04-17,14862927,7200,311901,2.0985

### Creating Views to store data for later visualizations

In [ ]:
%%sql

Create View view_PercentPopulationVaccinated as (
    SELECT 
        d.continent, 
        d.location, 
        d.date, 
        d.population, 
        v.new_vaccinations, 
        v.total_vaccinations,
        SUM(v.new_vaccinations) OVER (Partition by d.Location Order by d.location, d.Date) as RollingPeopleVaccinated
    JOIN 
        covid.covidvaccinations v 
    ON 
        d.location = v.location and d.date = v.date
    WHERE 
        d.continent <> ''
)